# Pandas

Pandas is an open source, BSD-licensed library providing high-performance, easy to use data structures
and data analysis tools for the Python programming language.

## Agenda

- What are Data Frames?
- What are Data Series?
- Different operations in Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'], columns=['column1','column2','column3','column4'])

In [3]:
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
df.to_csv('Test_df')

In [6]:
# Accessing the elements
# 1. .loc location    2. .iloc index location

df.loc['Row1']

column1    0
column2    1
column3    2
column4    3
Name: Row1, dtype: int32

In [7]:
type(df.loc['Row1'])

pandas.core.series.Series

# Data Frame

The combination of many columns and one or many rows.

# Series

Series can be one row or one column

In [8]:
df.iloc[:2,:2]

      column1  column2
Row1        0        1
Row2        4        5

In [9]:
type(df.iloc[:2,:2])

pandas.core.frame.DataFrame

In [10]:
df.iloc[:1,:2]

      column1  column2
Row1        0        1

In [11]:
type(df.iloc[:1,:1])

pandas.core.frame.DataFrame

In [12]:
df.iloc[:2,0]

Row1    0
Row2    4
Name: column1, dtype: int32

In [13]:
type(df.iloc[:2,0])

pandas.core.series.Series

In [14]:
df.iloc[0,0:3]

column1    0
column2    1
column3    2
Name: Row1, dtype: int32

In [15]:
# Convert data frame into an array

df.iloc[:2,0:3].values

array([[0, 1, 2],
       [4, 5, 6]])

In [16]:

df.iloc[:2,0:3].values.shape

(2, 3)

In [17]:
df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [18]:
df

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [19]:
# number of recurrence for each value

df['column1'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: column1, dtype: int64

In [20]:
df['column1'].unique()

array([ 0,  4,  8, 12, 16])

In [21]:
df['column3']

Row1     2
Row2     6
Row3    10
Row4    14
Row5    18
Name: column3, dtype: int32

In [22]:
type(df['column3'])

pandas.core.series.Series

In [23]:
df[['column3','column2']]

      column3  column2
Row1        2        1
Row2        6        5
Row3       10        9
Row4       14       13
Row5       18       17

In [24]:
type(df[['column3','column2']])

pandas.core.frame.DataFrame

- CSV means comma separated values

In [25]:
df=pd.read_csv('Mercedes_train.csv')

In [26]:
df

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4204,8405,107.39,ak,s,as,c,d,aa,d,q,...,1,0,0,0,0,0,0,0,0,0
4205,8406,108.77,j,o,t,d,d,aa,h,h,...,0,1,0,0,0,0,0,0,0,0
4206,8412,109.22,ak,v,r,a,d,aa,g,e,...,0,0,1,0,0,0,0,0,0,0
4207,8415,87.48,al,r,e,f,d,aa,l,u,...,0,0,0,0,0,0,0,0,0,0
4208,8417,110.85,z,r,ae,c,d,aa,g,w,...,1,0,0,0,0,0,0,0,0,0

In [27]:
df.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

With describe, the cathegoral features are ignored because it is not possible to calculate these statistic measures on them

In [28]:
# Get the unique category counts
df['X0'].value_counts()

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
m      34
ai     34
e      32
ba     27
at     25
a      21
ax     19
aq     18
am     18
i      18
u      17
aw     16
l      16
ad     14
au     11
k      11
b      11
r      10
as     10
bc      6
ao      4
c       3
aa      2
q       2
ac      1
g       1
ab      1
Name: X0, dtype: int64

# CSV

In [29]:
from io import StringIO,BytesIO

In [33]:
data = ('col1,col2,col3\n'
           'x,y,1\n'
           'a,b,2\n'
           'c,d,3')

In [34]:
type(data)

str

In [35]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [36]:
StringIO()

In [39]:
## read from specific columns

df = pd.read_csv(StringIO(data),usecols=['col1','col3'])

In [40]:
df

  col1  col3
0    x     1
1    a     2
2    c     3

In [41]:
df.to_csv('test.csv')

In [45]:
data = ('a,b,c,d\n'
           '1,2,3,4\n'
           '5,6,7,8\n'
           '9,10,11,12')

In [46]:
# specifying column data types

df = pd.read_csv(StringIO(data),dtype=object)

In [47]:
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [49]:
df['a']

0    1
1    5
2    9
Name: a, dtype: object

In [50]:
df['a'][1]

'5'

In [51]:
df = pd.read_csv(StringIO(data),dtype=int)

In [52]:
df['a']

0    1
1    5
2    9
Name: a, dtype: int32

In [53]:
df = pd.read_csv(StringIO(data),dtype=float)

In [54]:
df

     a     b     c     d
0  1.0   2.0   3.0   4.0
1  5.0   6.0   7.0   8.0
2  9.0  10.0  11.0  12.0

In [55]:
df['a']

0    1.0
1    5.0
2    9.0
Name: a, dtype: float64

In [57]:
df = pd.read_csv(StringIO(data),dtype={'b':int,'c':float,'a':'int64'})

In [58]:
df

   a   b     c   d
0  1   2   3.0   4
1  5   6   7.0   8
2  9  10  11.0  12

In [59]:
df['a'][1]

5

In [60]:
df['d']

0     4
1     8
2    12
Name: d, dtype: int64

In [62]:
data = ('index,a,b,c\n'
           '4,apple,bat,5.7\n'
           '8,orange,cow,10')

In [63]:
pd.read_csv(StringIO(data))

   index       a    b     c
0      4   apple  bat   5.7
1      8  orange  cow  10.0

In [65]:
# considers the first colmun as index
pd.read_csv(StringIO(data),index_col=0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [66]:
pd.read_csv(StringIO(data),index_col=2)

     index       a     c
b
bat      4   apple   5.7
cow      8  orange  10.0

In [67]:
data = ('a,b,c\n'
           '4,apple,bat,\n'
           '8,orange,cow,')

In [68]:
pd.read_csv(StringIO(data))

        a    b   c
4   apple  bat NaN
8  orange  cow NaN

In [69]:
pd.read_csv(StringIO(data),index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [70]:
pd.read_csv(StringIO(data),usecols=['b','c'],index_col=False)

        b    c
0   apple  bat
1  orange  cow

In [72]:
pd.read_csv(StringIO(data),usecols=['b','c'])

     b   c
4  bat NaN
8  cow NaN

In [73]:
# Quoting and Ecape Characters. Very useful in NLP

data= 'a,b\n"hello, \\"Bob\\", nice to see you",5'

In [75]:
pd.read_csv(StringIO(data),escapechar='\\')

                               a  b
0  hello, "Bob", nice to see you  5